-- 1.employeeテーブルの全データを取得　--
SELECT * FROM employee;
/* 
+----+--------+-----+--------------------------+--------+---------------+
| id | name   | age | job                      | sal    | department_id |
+----+--------+-----+--------------------------+--------+---------------+
|  1 | 松田   |  65 | 社長                     | 950000 |             1 |
|  2 | 山田   |  43 | 部長                     | 680000 |             2 |
|  3 | 北條   |  30 | 営業マネージャー         | 600000 |             3 |
|  4 | 佐藤   |  28 | エンジニア               | 500000 |             2 |
|  5 | 鈴木   |  35 | エンジニア               | 550000 |             2 |
+----+--------+-----+--------------------------+--------+---------------+
10 rows in set (0.01 sec)
*/
-- 2. employeeテーブルからnameとsal列のみを取得 --
SELECT name, sal FROM employee;
/*
+--------+--------+
| name   | sal    |
+--------+--------+
| 松田   | 950000 |
| 山田   | 680000 |
| 北條   | 600000 |
| 佐藤   | 500000 |
| 鈴木   | 550000 |
| 松田   | 950000 |
| 山田   | 680000 |
| 北條   | 600000 |
| 佐藤   | 500000 |
| 鈴木   | 550000 |
+--------+--------+
10 rows in set (0.00 sec)
*/
-- employeeテーブルからsalが500,000以上のデータを取得 --
SELECT * FROM employee WHERE sal >= 500000;
/*
+----+--------+-----+--------------------------+--------+---------------+
| id | name   | age | job                      | sal    | department_id |
+----+--------+-----+--------------------------+--------+---------------+
|  1 | 松田   |  65 | 社長                     | 950000 |             1 |
|  2 | 山田   |  43 | 部長                     | 680000 |             2 |
|  3 | 北條   |  30 | 営業マネージャー         | 600000 |             3 |
|  5 | 鈴木   |  35 | エンジニア               | 550000 |             2 |
+----+--------+-----+--------------------------+--------+---------------+
*/
-- employeeテーブルをsalの降順で並べ替え --
SELECT * FROM employee ORDER BY sal DESC;
/*
+----+--------+-----+--------------------------+--------+---------------+
| id | name   | age | job                      | sal    | department_id |
+----+--------+-----+--------------------------+--------+---------------+
|  1 | 松田   |  65 | 社長                     | 950000 |             1 |
|  2 | 山田   |  43 | 部長                     | 680000 |             2 |
|  3 | 北條   |  30 | 営業マネージャー         | 600000 |             3 |
|  5 | 鈴木   |  35 | エンジニア               | 550000 |             2 |
|  4 | 佐藤   |  28 | エンジニア               | 500000 |             2 |
+----+--------+-----+--------------------------+--------+---------------+
*/
-- employeeテーブルに新しいデータを追加する
INSERT INTO employee (name, age, job, sal, department_id) VALUES ('田中', 30, '営業担当', 500000, 3);
/*
+----+--------+-----+--------------------------+--------+---------------+
| id | name   | age | job                      | sal    | department_id |
+----+--------+-----+--------------------------+--------+---------------+
|  1 | 松田   |  65 | 社長                     | 950000 |             1 |
|  2 | 山田   |  43 | 部長                     | 680000 |             2 |
|  3 | 北條   |  30 | 営業マネージャー         | 600000 |             3 |
|  4 | 佐藤   |  28 | エンジニア               | 500000 |             2 |
|  5 | 鈴木   |  35 | エンジニア               | 550000 |             2 |
|  6 | 佐藤   |  35 | 営業                     | 550000 |          NULL |
+----+--------+-----+--------------------------+--------+---------------+
*/
-- employeeテーブルの松田さんの月給を1,000,000に更新する --
UPDATE employee SET sal = 1000000 WHERE name = '松田';
/*
+----+--------+-----+--------------------------+---------+---------------+
| id | name   | age | job                      | sal     | department_id |
+----+--------+-----+--------------------------+---------+---------------+
|  1 | 松田   |  65 | 社長                     | 1000000 |             1 |
|  2 | 山田   |  43 | 部長                     |  680000 |             2 |
|  3 | 北條   |  30 | 営業マネージャー         |  600000 |             3 |
|  4 | 佐藤   |  28 | エンジニア               |  500000 |             2 |
|  5 | 鈴木   |  35 | エンジニア               |  550000 |             2 |
|  6 | 佐藤   |  35 | 営業                     |  550000 |          NULL |
+----+--------+-----+--------------------------+---------+---------------+
*/
-- employeeテーブルから北條さんのデータを削除する --
UPDATE project SET employee_id = NULL WHERE employee_id = 3;
DELETE FROM employee WHERE name = '北條';
/*
+----+--------+-----+-----------------+---------+---------------+
| id | name   | age | job             | sal     | department_id |
+----+--------+-----+-----------------+---------+---------------+
|  1 | 松田   |  65 | 社長            | 1000000 |             1 |
|  2 | 山田   |  43 | 部長            |  680000 |             2 |
|  4 | 佐藤   |  28 | エンジニア      |  500000 |             2 |
|  5 | 鈴木   |  35 | エンジニア      |  550000 |             2 |
|  6 | 佐藤   |  35 | 営業            |  550000 |          NULL |
+----+--------+-----+-----------------+---------+---------------+
*/
-- employeeテーブルのデータ件数を取得 --
SELECT COUNT(*) FROM employee;
/*
+----------+
| COUNT(*) |
+----------+
|        5 |
+----------+
*/
-- employeeテーブルのjob列に含まれる重複を排除して取得 --
SELECT DISTINCT job FROM employee;
/*
| job             |
+-----------------+
| 社長            |
| 部長            |
| エンジニア      |
| 営業            |
+-----------------+
*/
-- employeeテーブルをjobごとにグループ化し、各jobごとの社員数を取得 --
SELECT job, COUNT(*) AS cnt FROM employee GROUP BY job;
/*
+-----------------+-----+
| job             | cnt |
+-----------------+-----+
| 社長            |   1 |
| 部長            |   1 |
| エンジニア      |   2 |
| 営業            |   1 |
+-----------------+-----+
*/